In [2]:
import pandas as pd

In [2]:
import pandas as pd

data = {'Maths': 60, 'Science': 89, 'English': 76, 'Social Science': 86}
subjects = ["Maths", "Science", "Art and Craft" , "Social Science"]

marks_series = pd.Series(data, index = subjects)

print(marks_series)

Maths             60.0
Science           89.0
Art and Craft      NaN
Social Science    86.0
dtype: float64

In [3]:
marks_series.isnull()

Maths             False
Science           False
Art and Craft      True
Social Science    False
dtype: bool

In [4]:
marks_series.notnull()

Maths              True
Science            True
Art and Craft     False
Social Science     True
dtype: bool

In [5]:
import numpy as np
num = pd.Series(np.random.random(15)*10).round()

In [6]:
num

0      2.0
1     10.0
2      8.0
3      8.0
4      8.0
5      9.0
6      5.0
7      7.0
8     10.0
9      8.0
10     5.0
11     3.0
12     7.0
13     1.0
14     5.0
dtype: float64

In [8]:
square = pd.Series(num*num)
square

0       4.0
1     100.0
2      64.0
3      64.0
4      64.0
5      81.0
6      25.0
7      49.0
8     100.0
9      64.0
10     25.0
11      9.0
12     49.0
13      1.0
14     25.0
dtype: float64

In [9]:
square + 5

0       9.0
1     105.0
2      69.0
3      69.0
4      69.0
5      86.0
6      30.0
7      54.0
8     105.0
9      69.0
10     30.0
11     14.0
12     54.0
13      6.0
14     30.0
dtype: float64

In [11]:
square.index = num
square

2.0       4.0
10.0    100.0
8.0      64.0
8.0      64.0
8.0      64.0
9.0      81.0
5.0      25.0
7.0      49.0
10.0    100.0
8.0      64.0
5.0      25.0
3.0       9.0
7.0      49.0
1.0       1.0
5.0      25.0
dtype: float64

In [12]:
square.name = 'Square'
square.index.name = 'Number'

square.index

Index([2.0, 10.0, 8.0, 8.0, 8.0, 9.0, 5.0, 7.0, 10.0, 8.0, 5.0, 3.0, 7.0, 1.0,
       5.0],
      dtype='float64', name='Number')

In [14]:
square[5]

Number
5.0    25.0
5.0    25.0
5.0    25.0
Name: Square, dtype: float64

In [21]:
square[2:9]

/var/folders/ts/t0y8j7tn61v2qmfqjwmswtmm0000gn/T/ipykernel_51546/1124095633.py:1: FutureWarning: The behavior of obj[i:j] with a float-dtype index is deprecated. In a future version, this will be treated as positional instead of label-based. For label-based slicing, use obj.loc[i:j] instead
  square[2:9]

Number
2.0       4.0
10.0    100.0
8.0      64.0
8.0      64.0
8.0      64.0
9.0      81.0
Name: Square, dtype: float64

In [24]:
square

Number
2.0       4.0
10.0    100.0
8.0      64.0
8.0      64.0
8.0      64.0
9.0      81.0
5.0      25.0
7.0      49.0
10.0    100.0
8.0      64.0
5.0      25.0
3.0       9.0
7.0      49.0
1.0       1.0
5.0      25.0
Name: Square, dtype: float64

In [25]:
square.iloc[0]

4.0

In [27]:
square.iloc[2:7]

Number
8.0    64.0
8.0    64.0
8.0    64.0
9.0    81.0
5.0    25.0
Name: Square, dtype: float64

In [28]:
square.sort_values(ascending= True)

Number
1.0       1.0
2.0       4.0
3.0       9.0
5.0      25.0
5.0      25.0
5.0      25.0
7.0      49.0
7.0      49.0
8.0      64.0
8.0      64.0
8.0      64.0
8.0      64.0
9.0      81.0
10.0    100.0
10.0    100.0
Name: Square, dtype: float64

In [29]:
square.sort_values(ascending= False)

Number
10.0    100.0
10.0    100.0
9.0      81.0
8.0      64.0
8.0      64.0
8.0      64.0
8.0      64.0
7.0      49.0
7.0      49.0
5.0      25.0
5.0      25.0
5.0      25.0
3.0       9.0
2.0       4.0
1.0       1.0
Name: Square, dtype: float64

In [30]:
square.sort_index(ascending= True)

Number
1.0       1.0
2.0       4.0
3.0       9.0
5.0      25.0
5.0      25.0
5.0      25.0
7.0      49.0
7.0      49.0
8.0      64.0
8.0      64.0
8.0      64.0
8.0      64.0
9.0      81.0
10.0    100.0
10.0    100.0
Name: Square, dtype: float64

In [31]:
marks_series.sort_values(ascending= True)

Maths             60.0
Social Science    86.0
Science           89.0
Art and Craft      NaN
dtype: float64

In [32]:
marks_series['Art and Craft'] = 73

In [33]:
marks_series

Maths             60.0
Science           89.0
Art and Craft     73.0
Social Science    86.0
dtype: float64

In [37]:
marks_series[marks_series > 75.0 ]

Science           89.0
Social Science    86.0
dtype: float64

In [38]:
marks_series['Science'] > 75.0

True

In [39]:
marks_series.sort_index(ascending=True)

Art and Craft     73.0
Maths             60.0
Science           89.0
Social Science    86.0
dtype: float64

In [5]:
df = pd.read_csv('./Dataset/Salary_Data.csv')

In [6]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 612.0 bytes

In [4]:
df = pd.read_csv('./Dataset/trains.csv')

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.iloc[2:,:2]

     PassengerId  Survived
2              3         1
3              4         1
4              5         0
5              6         0
6              7         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[889 rows x 2 columns]

In [ ]:
import pandas as pd
Series_1 = pd.Series([10,20,30,40,50],index=['one','four','two','three','five'])
print(Series_1)

Series_1['two']